validation_cases/workshop2/lidDrivenCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/parameters"

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         $simTime;

deltaT          $dt;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc residuals
    #includeFunc singleGraph

    /*vorticity
    {
        type        vorticity;
        libs        ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
    
    vorticityMinMax
    {
        type        fieldMinMax;
        libs        ("libfieldFunctionObjects.so");
        writeToFile yes;
        log         yes;
        location    yes;
        mode        magnitude;
        fields      (vorticity);
    }*/
}
// ************************************************************************* //
