validation_cases/workshop2/lidDrivenCavity/constant/parameters.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

dim       0.1;

size      30;

simTime   5;

dt        0.001;

vel       1;

Re        100;

// ************************************************************************* //
