validation_cases/workshop2/lidDrivenCavity/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/
#include "${FOAM_CASE}/system/blockMeshDict"

nLines  $size;
start   (#calc "$dim/2.0" 0 0);
end     (#calc "$dim/2.0" #calc "$dim/2.0" 0);
fields  (U);

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

// ************************************************************************* //
